<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class ContactUsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        DB::table('contact_us')->insert([
            [
                'from_name'=>'علي محمد' ,
                'from_email'=> 'ali@gmial.com',
                'from_phone'=> '0599455645',
                'to'=> 'عمادة الشؤون الأكاديمية' ,                
                'receiver_type'=>' عمادات',
                'subject'=>'تغذية راجعة',
                'body'=>'هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.' ,
                'status'=>1 ,

            ],
            [
                'from_name'=>'أحمد محمد' ,
                'from_email'=> 'ahmed@gmail.com',
                'from_phone'=> '0599455645',
                'to'=> 'كلية الحاسبات' ,
                'receiver_type'=>' كليات',
                'subject'=>'تغذية راجعة',
                'body'=>'هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.
                إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع.' ,
                'status'=>2 ,

            ],
            [
                'from_name'=>'محمود عيسى' ,
                'from_email'=> 'mahmoud@gmail.com',
                'from_phone'=> '0599455645',
                'to'=> 'عمادة الشؤن الإدارية' ,
                'receiver_type'=>' عمادات',
                'subject'=>'تغذية راجعة',
                'body'=>'إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع.' ,
                'status'=>0 ,

            ]
        
        ]);

        
           
    }
}
