<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class WorkshopSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        DB::table('workshops')->insert([
            [
                'title' => 'مقدمة في علم البيانات',
                // 'description' => "تعرف على أساسيات علم البيانات وتطبيقاتها",
                'description' => 
                "تقدم هذه الدورة الشاملة فرصة ممتازة للمشاركين لاكتساب مهارات متقدمة في مجال تحليل البيانات وعلم البيانات. سيتعلم المشاركون كيفية تحليل وتنظيف البيانات، واستخدام أدوات تحليل البيانات مثل Python وR. سيتم توضيح أساسيات تصور البيانات وتحويلها إلى رؤى قيمة من خلال تطبيقات عملية ودروس تفاعلية.

سيكتسب المشاركون أيضًا فهماً عميقًا لتقنيات تعلم الآلة والذكاء الاصطناعي، وسيتعلمون كيفية تطبيق هذه التقنيات لتحقيق تحليلات تنبؤية دقيقة. ستتاح لهم الفرصة للتعلم من خلال مشاريع تطبيقية وحالات دراسية تعكس التحديات الحقيقية التي يمكن مواجهتها في عالم تحليل البيانات.

باختتام هذه الدورة، سيكون لدى المشاركين القدرة على تحليل مجموعات البيانات المعقدة، واستخراج أنماط قيمة منها، واتخاذ قرارات استراتيجية قائمة على الأدلة. سيتركز التدريب على الجوانب العملية والتطبيقية، مما يسمح للمشاركين بتطبيق المهارات التي يكتسبونها بفعالية في بيئات العمل
 الحقيقية."
                ,
                'start_date' => now(),
                'schedule' => 'الإثنين والأربعاء 8-10 صباحًا',
                'deadline'=> now()->addDays(20), 
                'url'=>'https://forms.gle/phD3Gaj3jMKLcGXy9',
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'title' => 'تطوير وبرمجة الويب',
                'description' => 
                "تقدم هذه الدورة الشاملة فرصة ممتازة للمشاركين لاكتساب مهارات متقدمة في مجال تحليل البيانات وعلم البيانات. سيتعلم المشاركون كيفية تحليل وتنظيف البيانات، واستخدام أدوات تحليل البيانات مثل Python وR. سيتم توضيح أساسيات تصور البيانات وتحويلها إلى رؤى قيمة من خلال تطبيقات عملية ودروس تفاعلية.

                سيكتسب المشاركون أيضًا فهماً عميقًا لتقنيات تعلم الآلة والذكاء الاصطناعي، وسيتعلمون كيفية تطبيق هذه التقنيات لتحقيق تحليلات تنبؤية دقيقة. ستتاح لهم الفرصة للتعلم من خلال مشاريع تطبيقية وحالات دراسية تعكس التحديات الحقيقية التي يمكن مواجهتها في عالم تحليل البيانات.
                
                باختتام هذه الدورة، سيكون لدى المشاركين القدرة على تحليل مجموعات البيانات المعقدة، واستخراج أنماط قيمة منها، واتخاذ قرارات استراتيجية قائمة على الأدلة. سيتركز التدريب على الجوانب العملية والتطبيقية، مما يسمح للمشاركين بتطبيق المهارات التي يكتسبونها بفعالية في بيئات العمل
                 الحقيقية."
                ,
                'start_date' => now()->addDays(7),
                'schedule' => 'السبت 10 صباحًا',
                'deadline'=> now()->addDays(20), 
                'url'=>'https://forms.gle/phD3Gaj3jMKLcGXy9',
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'title' => 'أساسيات تعلم الآلة',
                'description' => "استكشف أساسيات خوارزميات وتقنيات التعلم الآلي",
                'start_date' => now()->addDays(14),
                'schedule' => 'الإثنين و الأربعاء 4:30 - 6:30 مساءً',
                'deadline'=> now()->addDays(20),
                'url'=>'https://forms.gle/phD3Gaj3jMKLcGXy9',
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'title' => 'استيراتيجيات التسويق الرقمي',
                'description' => 'تعرف على استراتيجيات التسويق الرقمي الفعالة للشركات',
                'start_date' => now()->addDays(21),
                'schedule' => 'الأربعاء 5:30 - 8:30 مساءً',
                'deadline'=> now()->addDays(20), 
                'url'=>'https://forms.gle/phD3Gaj3jMKLcGXy9',
                'created_at' => now(),
                'updated_at' => now(),
            ],
        ]);
    }
}
